logs/log_find_document_2025-03-18_10-59-51.txt

==== SOAP Request ====
Request Body:
<?xml version='1.0' encoding='UTF-8'?>
        <soapenv:Envelope
            xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
            xmlns:wsa="http://www.w3.org/2005/08/addressing"
            xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
            xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
            xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0">
            <soapenv:Header>
                <wsa:To soapenv:mustUnderstand="true">http://localhost:8084/xdstools7.12.0/sim/default__registry01/reg/sq</wsa:To>
                <wsa:MessageID soapenv:mustUnderstand="true">urn:uuid:175709BC017996C4D31741859309458</wsa:MessageID>
                <wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:RegistryStoredQuery</wsa:Action>
            </soapenv:Header>
            <soapenv:Body>
                <query:AdhocQueryRequest>
                    <query:ResponseOption returnComposedObjects="true" returnType="LeafClass"/>
                    <rim:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
                        <rim:Slot name="$XDSDocumentEntryPatientId">
                        <rim:ValueList>
                            <rim:Value>'P0307123951.2^^^&amp;1.3.6.1.4.1.21367.13.20.1000&amp;ISO'</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>

                    <rim:Slot name="$XDSDocumentEntryType">
                        <rim:ValueList>
                            <rim:Value>('urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1')</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>

                    <rim:Slot name="$XDSDocumentEntryStatus">
                        <rim:ValueList>
                            <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
                            <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Deprecated')</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>

                    </rim:AdhocQuery>
                </query:AdhocQueryRequest>
            </soapenv:Body>
        </soapenv:Envelope>
        

==== Response ====
Response Code: 200
Response Body:

<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
   <S:Header>
      <wsa:Action s:mustUnderstand="1" xmlns:s="http://www.w3.org/2003/05/soap-envelope"
            xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RegistryStoredQueryResponse</wsa:Action>
      <wsa:RelatesTo xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:175709BC017996C4D31741859309458</wsa:RelatesTo>
   </S:Header>
   <S:Body>
      <query:AdhocQueryResponse status="urn:oasis:names:tc:ebxml-regrep:ResponseStatusType:Success"
            xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
         <rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
            <rim:ExtrinsicObject id="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                  mimeType="application/pdf" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1"
                  lid="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                  status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved">
               <rim:Slot name="repositoryUniqueId">
                  <rim:ValueList>
                     <rim:Value>1.1.4567332.1.2</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="hash">
                  <rim:ValueList>
                     <rim:Value>0242972a12812218c5a025570e2d26a83802a640</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="size">
                  <rim:ValueList>
                     <rim:Value>16452</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="creationTime">
                  <rim:ValueList>
                     <rim:Value>20061224</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="languageCode">
                  <rim:ValueList>
                     <rim:Value>en-us</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="serviceStartTime">
                  <rim:ValueList>
                     <rim:Value>200612230800</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="serviceStopTime">
                  <rim:ValueList>
                     <rim:Value>200612230900</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="sourcePatientId">
                  <rim:ValueList>
                     <rim:Value>89765a87b^^^&amp;1.2.3.4.5&amp;ISO</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Slot name="sourcePatientInfo">
                  <rim:ValueList>
                     <rim:Value>PID-3|pid1^^^&amp;1.2.3&amp;ISO</rim:Value>
                     <rim:Value>PID-5|Doe^John^^^</rim:Value>
                     <rim:Value>PID-7|19560527</rim:Value>
                     <rim:Value>PID-8|M</rim:Value>
                     <rim:Value>PID-11|100 Main St^^Metropolis^Il^44130^USA</rim:Value>
                  </rim:ValueList>
               </rim:Slot>
               <rim:Name>
                  <rim:LocalizedString value="DocA"/>
               </rim:Name>
               <rim:Description/>
               <rim:VersionInfo versionName="1"/>
               <rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:594ab67c-f520-43bb-98c2-c941470d3be7">
                  <rim:Slot name="authorPerson">
                     <rim:ValueList>
                        <rim:Value>^Smitty^Gerald^^^</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorInstitution">
                     <rim:ValueList>
                        <rim:Value>Cleveland Clinic</rim:Value>
                        <rim:Value>Parma Community</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorRole">
                     <rim:ValueList>
                        <rim:Value>Attending</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorSpecialty">
                     <rim:ValueList>
                        <rim:Value>Orthopedic</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:8df83207-fa77-404b-9c03-dded6f071177">
                  <rim:Slot name="authorPerson">
                     <rim:ValueList>
                        <rim:Value>^Dopplemeyer^Sherry^^^</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorInstitution">
                     <rim:ValueList>
                        <rim:Value>Cleveland Clinic</rim:Value>
                        <rim:Value>Berea Community</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorRole">
                     <rim:ValueList>
                        <rim:Value>Primary Surgon</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Slot name="authorSpecialty">
                     <rim:ValueList>
                        <rim:Value>Orthopedic</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="PLANS" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:d7baec23-8adb-4f99-a433-8944ad7b4aff">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.19376.1.2.6.1</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Treatment Plan or Protocol"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="R" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:64e89767-49ed-40e5-9695-9bc0d467b18f">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>2.16.840.1.113883.5.25</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Restricted"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="urn:ihe:iti:bppc:2007"
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:6688bf27-fb95-4de4-8d83-f5b3cf8b84fa">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.19376.1.2.3</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="urn:ihe:iti:bppc:2007"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="66280005"
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:3b80e6c5-cd6f-4759-a433-93c7d3a5988d">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>2.16.840.1.113883.6.96</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Private home-based care"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="Practice-D"
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:b7e2bf81-bbaa-4e51-958b-b2289066d205">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.21367.2017.3</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Pathology"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="urn:connectathon:bppc:foundational:policy"
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:123c40eb-c01a-4808-a9f2-d11a6efa860d">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.21367.2017.3</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="Foundational Connectathon Read-Access Policy"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="urn:connectathon:policy:full-access"
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:4e100b5a-db6b-490c-8a94-ff132417e9cd">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>1.3.6.1.4.1.21367.2017.3</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="FULL ACCESS TO ALL POLICY"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983"
                     classifiedObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18"
                     nodeRepresentation="11502-2" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"
                     id="urn:uuid:361db338-86bc-4aaa-8432-d0c0252be975">
                  <rim:Slot name="codingScheme">
                     <rim:ValueList>
                        <rim:Value>2.16.840.1.113883.6.1</rim:Value>
                     </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                     <rim:LocalizedString value="LABORATORY REPORT.TOTAL"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:Classification>
               <rim:ExternalIdentifier identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427"
                     value="P0307123951.2^^^&amp;1.3.6.1.4.1.21367.13.20.1000&amp;ISO"
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                     id="urn:uuid:e6543e72-5154-4902-9b15-d957eea621a7"
                     registryObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18">
                  <rim:Name>
                     <rim:LocalizedString value="XDSDocumentEntry.patientId"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:ExternalIdentifier>
               <rim:ExternalIdentifier identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab"
                     value="1.2.42.20250307123950.22"
                     objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                     id="urn:uuid:38400c88-1954-4e8d-ba86-d6c1dcbcaf3e"
                     registryObject="urn:uuid:8b88149d-5239-4510-8c0a-fef7c7aaaa18">
                  <rim:Name>
                     <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
                  </rim:Name>
                  <rim:VersionInfo versionName="-1"/>
               </rim:ExternalIdentifier>
            </rim:ExtrinsicObject>
         </rim:RegistryObjectList>
      </query:AdhocQueryResponse>
   </S:Body>
</S:Envelope>
